{"id":"31cb159","owner":"bob@example.com","about":{"name":"Bob Demo","bio":"Engineer with a strong interest in distributed, highly-scalable and cloud-based systems architecture.\n\nWorked for years in SysOps roles, focused on infrastructure management and Cloud.\n\nExperienced in the finance sector, specifically on high-performance payment platforms and systems compliance (PCI - Level 1).\n\nManaged production-grade, Kubernetes clusters, with tens of micro-services and wrote infrastructure tooling to support it in Go.","passion":"Ever since I was a kid, software development has been my passion. I still remember sitting in front of an Atari 800 computer, with the BASIC cartridge loaded in, making it print \"Hello, Bob\" for the very first time.","title":"Data Engineer","photo_url":"https://res.cloudinary.com/hr4dwyqtz/image/upload/c_scale,q_auto:best,w_600/v1601459451/profile/c3ca181590ac041e9aba928678140768.png"},"network":[{"type":"Github","url":"https://github.com/example"}, {"type":"Email","url":"https://github.com/example"}],"education":[{"place":"King's College","period":"2003 - 2007","description":"Computer Science BSc"}],"experience":[{"place":"UK Package Holiday site","period":"","description":"Initially involved in developing and stabilising multi-linux environment, leveraging variety of Open Source Software, provisioning and supporting underlying hardware with virtualisation stack across environments.\nLater, facilitating and supporting the Migration to Google Cloud Platform. This involved the introduction of new microservice tailored infrastructure.\nReworked automated deployment pipelines to enable successful transition applications from on-prem to cloud, in a cloud native form, across all environments in a short timeframe, with consideration to user traffic and security. On-Call support.","role":"Senior DevOps Engineer"},{"place":"Pan European Broadcast and Entertainment Company","period":"","description":"Supported in-house product development teams, fast-tracking technology requirements and PoC and internal production system deliveries, using VMware virtualisation with ansible configuration management. Coaching and training, with demo knowledge sharing sessions.\nManaged end-to-end data centre delivery process with hands-on procurement, installation and configuration of said hardware and software, liaising with networking services as appropriate. Supported and Managed in-house atlassian Jira and Confluence suite.","role":"Senior DevOps Engineer"}],"skills":[{"name":"AWS","org_skill_id":3839},{"name":"Java","org_skill_id":1011},{"name":"Python","org_skill_id":3836},{"name":"Kubernetes","org_skill_id":3840},{"name":"Ansible","org_skill_id":3841},{"name":"Go","org_skill_id":3842},{"name":"Git","org_skill_id":3837}],"path":"/bob.demo/31cb159","theme":"69299d80-aba2-4870-9460-12644d7d430f","links":{"pdf":""},"technologies":null,"certifications":[{"name":"GCP Professional Cloud Architect","place":"Google Cloud","period":""},{"name":"GCP Professional Data Engineer","place":"Google Cloud","period":""},{"name":"AWS Certified SysOps Administrator","place":"AWS","period":""},{"name":"Microsoft Certified Azure Administrator","place":"Microsoft","period":""}],"conferences":[],"tracks":[{"track_id":3,"level":3,"visible":true,"name":"Backend","category":"Engineering","desc":"Develops expertise in server side engineering, using technologies such as Java, Go, NodeJS, or Ruby"},{"track_id":5,"level":0,"visible":false,"name":"IoT","category":"Engineering","desc":"Develops expertise in building IoT technology, with experience in embedded electronics, software, sensors, actuators, and connectivity"},{"track_id":17,"level":2,"visible":true,"name":"Machine Learning","category":"Engineering","desc":"Develops expertise in Machine Learning practices, such as probability, statistics, data structures, and algorithms"},{"track_id":4,"level":4,"visible":true,"name":"Devops","category":"Engineering","desc":"Develops expertise in Devops engineering, such as cloud infrastructure, deployments, pipelines, databases, and automation"},{"track_id":2,"level":0,"visible":false,"name":"Mobile","category":"Engineering","desc":"Develops expertise in native mobile platform engineering, such as iOS or Android"}],"desired_skills":[],"preference":null,"membership_id":1872,"completeness_score":80,"created_at":"2020-09-30T10:23:31.667Z","updated_at":"2021-03-01T13:58:49.572Z","$promise":{},"$resolved":true}
